In [35]:
from google.colab import drive
import os
drive.mount('/content/drive')
#os.chdir('drive/My Drive/courses/FML/2. Data Science/1. Data Analysis/2. Pandas')
!ls

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).
'1. pandas_intro.ipynb'
'2. pandas series.ipynb'
'3. Pandas DataFrame.ipynb'
'4. Selecting Subsets with [ ], .loc and .iloc.ipynb'
'5. Boolean Indexing.ipynb'
'6. Assigning subsets of data.ipynb'
'7. Other Important concepts in Pandas.ipynb'
'8. Groupby.ipynb'
'capstone projects'
 data
 images
'pandas from numpy.pptx'
'Pandas Solutions(Part 4-6).ipynb'
'samples codes'

In [0]:
import pandas as pd
import numpy as np

In [37]:
df = pd.read_csv('data/sample_data.csv', index_col=0)
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

# Beginning with [] on DataFrames
Its main purpose is to select a single column or multiple columns of data.

## Selecting a single column as a Series
To select a single column of data, simply put the name of the column in-between the brackets. Let's select the food column:

In [38]:
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

In [39]:
df['food']

Jane          Steak
Niko           Lamb
Aaron         Mango
Penelope      Apple
Dean         Cheese
Christina     Melon
Cornelia      Beans
Name: food, dtype: object

## Selecting multiple columns with just the indexing operator
It's possible to select multiple columns with just the indexing operator by passing it a list of column names. Let's select `color`, `food`, and `score`:

In [40]:
df[['color', 'food', 'score']]

           color    food  score
Jane        blue   Steak    4.6
Niko       green    Lamb    8.3
Aaron        red   Mango    9.0
Penelope   white   Apple    3.3
Dean        gray  Cheese    1.8
Christina  black   Melon    9.5
Cornelia     red   Beans    2.2

# Selecting multiple columns returns a DataFrame
Selecting multiple columns returns a DataFrame.<br>
<span style="color:brown">**Note:**</span> You can actually select a single column as a DataFrame with a one-item list

In [41]:
df[['food']] # to_frame function can also be used

             food
Jane        Steak
Niko         Lamb
Aaron       Mango
Penelope    Apple
Dean       Cheese
Christina   Melon
Cornelia    Beans

Although, this resembles the Series from above, it is technically a DataFrame, a different object.

# Column order doesn't matter
When selecting multiple columns, you can select them in any order that you choose. It doesn't have to be the same order as the original DataFrame. For instance, let's select `height` and `color`.

In [42]:
df[['height', 'color']]

           height  color
Jane          165   blue
Niko           70  green
Aaron         120    red
Penelope       80  white
Dean          180   gray
Christina     172  black
Cornelia      150    red

# Exceptions
There are a couple common exceptions that arise when doing selections with just the indexing operator. 
* If you misspell a word, you will get a **`KeyError`**
* If you forgot to use a list to contain multiple columns you will also get a **`KeyError`**

In [43]:
df['height']

Jane         165
Niko          70
Aaron        120
Penelope      80
Dean         180
Christina    172
Cornelia     150
Name: height, dtype: int64

In [44]:
df['color', 'age'] # should be:  df[['color', 'age']]

KeyError: ignored

# Summary of []
* Its primary purpose is to select columns by the column names
* Select a single column as a Series by passing the column name directly to it: **`df['col_name']`**
* Select multiple columns as a DataFrame by passing a **list** to it: **`df[['col_name1', 'col_name2']]`**

# Getting started with `.loc`
The **`.loc`** indexer selects data in a different way than [] operator. It can select subsets of rows or columns. It can also simultaneously select subsets of rows and columns. Most importantly, it only selects data by the **LABEL** of the rows and columns.

# Select a single row as a  Series with `.loc`
The **`.loc`** indexer will return a single row as a Series when given a single row label. Let's select the row for **`Niko`**.

In [45]:
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

In [46]:
df.loc['Niko']

state        TX
color     green
food       Lamb
age           2
height       70
score       8.3
Name: Niko, dtype: object

We now have a Series, where the old column names are now the index labels. The **`name`** of the Series has become the old index label, **`Niko`** in this case.

# Select multiple rows as a DataFrame with `.loc`
To select multiple rows, put all the row labels you want to select in a list and pass that to **`.loc`**. Let's select `Niko` and `Penelope`.

In [47]:
df.loc[['Niko', 'Penelope']]

         state  color   food  age  height  score
Niko        TX  green   Lamb    2      70    8.3
Penelope    AL  white  Apple    4      80    3.3

# Use slice notation to select a range of rows with `.loc`
It is possible to 'slice' the rows of a DataFrame with `.loc` by using **slice notation**. Slice notation uses a colon to separate **start**, **stop** and **step** values. For instance we can select all the rows from `Niko` through `Dean` like this:

In [48]:
df.loc['Niko':'Dean':1]

         state  color    food  age  height  score
Niko        TX  green    Lamb    2      70    8.3
Aaron       FL    red   Mango   12     120    9.0
Penelope    AL  white   Apple    4      80    3.3
Dean        AK   gray  Cheese   32     180    1.8

### <span style="color:brown">Note 1: </span>`.loc` includes the last value with slice notation
Notice that the row labeled with `Dean` was kept. In other data containers such as Python lists, the last value is excluded.

## Other slices
You can use slice notation similarly to how you use it with lists. Let's slice from the beginning through `Aaron`:

In [49]:
df.loc[:'Aaron']

      state  color   food  age  height  score
Jane     NY   blue  Steak   30     165    4.6
Niko     TX  green   Lamb    2      70    8.3
Aaron    FL    red  Mango   12     120    9.0

Slice from `Niko` to `Christina` stepping by 2:

In [50]:
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

In [51]:
df.loc['Niko':'Christina'] # similar to range() from last lecture.

          state  color    food  age  height  score
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5

Slice from `Dean` to the end:

In [52]:
df.loc['Dean':]

          state  color    food  age  height  score
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

# Selecting rows and columns simultaneously with `.loc`
Unlike just the indexing operator, it is possible to select rows and columns simultaneously with `.loc`. You do it by separating your row and column selections by a **comma**. It will look something like this:

```
df.loc[row_selection, column_selection]
```

## Select two rows and three columns
For instance, if we wanted to select the rows `Dean` and `Cornelia` along with the columns `age`, `state` and `score` we would do this:

In [53]:
df.loc[['Dean', 'Cornelia'], ['age', 'state', 'score']]

          age state  score
Dean       32    AK    1.8
Cornelia   69    TX    2.2

# Use any combination of selections for either row or columns for `.loc`
Row or column selections can be any of the following as we have already seen:
* A single label
* A list of labels
* A slice with labels

We can use any of these three for either row or column selections with **`.loc`**. Let's see some examples.

Let's select two rows and a single column:

In [54]:
df.loc[['Dean', 'Aaron'], 'food']

Dean     Cheese
Aaron     Mango
Name: food, dtype: object

In [55]:
df.loc['Dean', ['age', 'food']]

age         32
food    Cheese
Name: Dean, dtype: object

Select a slice of rows and a list of columns:

In [56]:
df.loc['Jane':'Penelope', ['state', 'color']] # slicing notation does not have []

         state  color
Jane        NY   blue
Niko        TX  green
Aaron       FL    red
Penelope    AL  white

Select a single row and a single column. This returns a scalar value.

In [57]:
df.loc['Jane', 'age']

30

Select a slice of rows and columns

In [58]:
df.loc[:'Dean', 'height':]

          height  score
Jane         165    4.6
Niko          70    8.3
Aaron        120    9.0
Penelope      80    3.3
Dean         180    1.8

## Selecting all of the rows and some columns
It is possible to select all of the rows by using a single colon. You can then select columns as normal:

In [59]:
df.loc[:, ['food', 'color']]

             food  color
Jane        Steak   blue
Niko         Lamb  green
Aaron       Mango    red
Penelope    Apple  white
Dean       Cheese   gray
Christina   Melon  black
Cornelia    Beans    red

You can also use this notation to select all of the columns:

In [60]:
df.loc[['Penelope','Cornelia'], :]

         state  color   food  age  height  score
Penelope    AL  white  Apple    4      80    3.3
Cornelia    TX    red  Beans   69     150    2.2

But, it isn't necessary as we have seen, so you can leave out that last colon:

In [61]:
df.loc[['Penelope','Cornelia']]

         state  color   food  age  height  score
Penelope    AL  white  Apple    4      80    3.3
Cornelia    TX    red  Beans   69     150    2.2

# Assign row and column selections to variables
It might be easier to assign row and column selections to variables before you use `.loc`. This is useful if you are selecting many rows or columns:

In [62]:
rows = ['Jane', 'Niko', 'Dean', 'Penelope', 'Christina'] # start:end
cols = ['state', 'age', 'height', 'score']
df.loc[rows, cols]

          state  age  height  score
Jane         NY   30     165    4.6
Niko         TX    2      70    8.3
Dean         AK   32     180    1.8
Penelope     AL    4      80    3.3
Christina    TX   33     172    9.5

# Summary of `.loc`

* Only uses labels
* Can select rows and columns simultaneously
* Selection can be a single label, a list of labels or a slice of labels
* Put a comma between row and column selections

# Getting started with `.iloc`
The `.iloc` indexer is very similar to `.loc` but only uses **integer locations** to make its selections. The word `.iloc` itself stands for integer location so that should help with remember what it does.

# Selecting a single row with `.iloc`
By passing a single integer to `.iloc`, it will select one row as a Series:

In [63]:
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

In [64]:
df.iloc[3]

state        AL
color     white
food      Apple
age           4
height       80
score       3.3
Name: Penelope, dtype: object

# Selecting multiple rows with `.iloc`
Use a list of integers to select multiple rows:

In [65]:
df.iloc[[5, 2, 4]]  # remember, don't do df.iloc[5, 2, 4]  Error!

          state  color    food  age  height  score
Christina    TX  black   Melon   33     172    9.5
Aaron        FL    red   Mango   12     120    9.0
Dean         AK   gray  Cheese   32     180    1.8

# Use slice notation to select a range of rows with `.iloc`
<span style="color:brown">**Note 1: **</span>Slice notation works just like a list in this instance and is exclusive of the last element

In [66]:
df.iloc[3:5]

         state  color    food  age  height  score
Penelope    AL  white   Apple    4      80    3.3
Dean        AK   gray  Cheese   32     180    1.8

Select 3rd position until end:

In [67]:
df.iloc[3:]

          state  color    food  age  height  score
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

Select 3rd position to end by 2:

In [68]:
df.iloc[3::2]

          state  color   food  age  height  score
Penelope     AL  white  Apple    4      80    3.3
Christina    TX  black  Melon   33     172    9.5

# Selecting rows and columns simultaneously with `.iloc`
Just like with `.iloc` any combination of a single integer, lists of integers or slices can be used to select rows and columns simultaneously. Just remember to separate the selections with a **comma**.

Select two rows and two columns:

In [69]:
df.iloc[[2,3], [0, 4]]

         state  height
Aaron       FL     120
Penelope    AL      80

Select a slice of the rows and two columns:

In [70]:
df.iloc[3:6, [1, 4]]

           color  height
Penelope   white      80
Dean        gray     180
Christina  black     172

Select slices for both

In [71]:
df.iloc[2:5, 2:5]

            food  age  height
Aaron      Mango   12     120
Penelope   Apple    4      80
Dean      Cheese   32     180

Select a single row and column

In [72]:
df.iloc[0, 2]

'Steak'

Select all the rows and a single column

In [73]:
df.iloc[:, 5]

Jane         4.6
Niko         8.3
Aaron        9.0
Penelope     3.3
Dean         1.8
Christina    9.5
Cornelia     2.2
Name: score, dtype: float64

# Selecting subsets of Series

We can also do subset selection with a Series. Since Series do not have columns, I suggest using only **`.loc`** and **`.iloc`**.

I will create a Series by selecting a single column from a DataFrame. Let's select the **`food`** column:

In [74]:
food = df['food']
# food[['Jane', 'Aaron']]
food

Jane          Steak
Niko           Lamb
Aaron         Mango
Penelope      Apple
Dean         Cheese
Christina     Melon
Cornelia      Beans
Name: food, dtype: object

# Series selection with `.loc`
Series selection with `.loc` is quite simple, since we are only dealing with a single dimension. You can again use a single row label, a list of row labels or a slice of row labels to make your selection. Let's see several examples.

Let's select a single value:

In [76]:
food

Jane          Steak
Niko           Lamb
Aaron         Mango
Penelope      Apple
Dean         Cheese
Christina     Melon
Cornelia      Beans
Name: food, dtype: object

In [77]:
food.loc['Aaron'] # label, list of labels, slice of labels

'Mango'

Select three different values. This returns a Series:

In [78]:
food.loc[['Dean', 'Niko', 'Cornelia']]

Dean        Cheese
Niko          Lamb
Cornelia     Beans
Name: food, dtype: object

Slice from `Niko` to `Christina` - is inclusive of last index

In [79]:
food.loc['Niko':'Christina']

Niko           Lamb
Aaron         Mango
Penelope      Apple
Dean         Cheese
Christina     Melon
Name: food, dtype: object

Slice from `Penelope` to the end:

In [80]:
food.loc['Penelope':]

Penelope      Apple
Dean         Cheese
Christina     Melon
Cornelia      Beans
Name: food, dtype: object

<span style="color:brown">**Note 1: **</span>Select a single value in a list which returns a Series

In [81]:
food.loc[['Aaron']]

Aaron    Mango
Name: food, dtype: object

# Series selection with `.iloc`
Series subset selection with **`.iloc`** happens similarly to **`.loc`** except it uses integer location. You can use a single integer, a list of integers or a slice of integers. Let's see some examples.

Select a single value:

In [82]:
food.iloc[0]

'Steak'

Use a list of integers to select multiple values:

In [83]:
food.iloc[[4, 1, 3]]

Dean        Cheese
Niko          Lamb
Penelope     Apple
Name: food, dtype: object

Use a slice - is exclusive of last integer

In [84]:
food.iloc[4:6]

Dean         Cheese
Christina     Melon
Name: food, dtype: object

# Comparison to Python lists and dictionaries
It may be helpful to compare pandas ability to make selections by label and integer location to that of Python lists and dictionaries.

Python lists allow for selection of data only through integer location. You can use a single integer or slice notation to make the selection but NOT a list of integers.

Let's see examples of subset selection of lists using integers:

In [0]:
some_list = ['a', 'two', 10, 4, 0, 'asdf', 'mgmt', 434, 99]

In [86]:
some_list[5]

'asdf'

In [87]:
some_list[-1]

99

In [88]:
some_list[:4]

['a', 'two', 10, 4]

In [89]:
some_list[3:]

[4, 0, 'asdf', 'mgmt', 434, 99]

In [90]:
some_list[2:6:3]

[10, 'asdf']

# Using [] operator to select rows from a DataFrame
Above, I used just the indexing operator to select a column or columns from a DataFrame. But, it can also be used to select rows using a **slice**. The entire operation changes completely when a **slice** is passed.

Let's use an integer slice as our first example:

In [91]:
df[3:6] # df.iloc[3:6, :]

          state  color    food  age  height  score
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5

To add to this confusion, you can slice by labels as well.

In [92]:
df['Aaron':'Christina']

          state  color    food  age  height  score
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5

# Cannot simultaneously select rows and columns with `[]`
An exception will be raised if you try and select rows and columns simultaneously with just the indexing operator. You must use **`.loc`** or **`.iloc`** to do so.

In [93]:
df[3:6, 'Aaron':'Christina']

TypeError: ignored

# Using [] operator to select rows from a Series
You can also use just the indexing operator with a Series. Let's see some examples

In [94]:
food

Jane          Steak
Niko           Lamb
Aaron         Mango
Penelope      Apple
Dean         Cheese
Christina     Melon
Cornelia      Beans
Name: food, dtype: object

In [95]:
food[2:4]

Aaron       Mango
Penelope    Apple
Name: food, dtype: object

In [96]:
food['Niko':'Dean']

Niko          Lamb
Aaron        Mango
Penelope     Apple
Dean        Cheese
Name: food, dtype: object

Since Series don't have columns you can use a single label and list of labels to make selections as well

In [97]:
food['Dean']

'Cheese'

In [98]:
food[['Dean', 'Christina', 'Aaron']]

Dean         Cheese
Christina     Melon
Aaron         Mango
Name: food, dtype: object

In [99]:
some_list[[1,3,5]]

TypeError: ignored

### Selection by label with Python dictionaries
All values in each dictionary are labeled by a **key**. We use this key to make single selections. Dictionaries only allow selection with a single label. Slices and lists of labels are not allowed.

In [0]:
d = {'a':1, 'b':2, 't':20, 'z':26, 'A':27}

In [101]:
d['a']

1

In [102]:
d['A']

27

### <span style="color:brown">Note: </span>Pandas has power of lists and dictionaries
DataFrames and Series are able to make selections with integers like a list and with labels like a dictionary.

# The default `RangeIndex`
If you don't specify a column to be the index when first reading in the data, pandas will use the integers 0 to n-1 as the index. This technically creates a **`RangeIndex`** object. Let's take a look at it.

In [0]:
import pandas as pd
import numpy as np

In [104]:
df2 = pd.read_csv('data/sample_data2.csv')
df2

       Names state  color    food  age  height  score
0       Jane    NY   blue   Steak   30     165    4.6
1       Niko    TX  green    Lamb    2      70    8.3
2      Aaron    FL    red   Mango   12     120    9.0
3   Penelope    AL  white   Apple    4      80    3.3
4       Dean    AK   gray  Cheese   32     180    1.8
5  Christina    TX  black   Melon   33     172    9.5
6   Cornelia    TX    red   Beans   69     150    2.2

In [105]:
df2.set_index('Names').reset_index()

       Names state  color    food  age  height  score
0       Jane    NY   blue   Steak   30     165    4.6
1       Niko    TX  green    Lamb    2      70    8.3
2      Aaron    FL    red   Mango   12     120    9.0
3   Penelope    AL  white   Apple    4      80    3.3
4       Dean    AK   gray  Cheese   32     180    1.8
5  Christina    TX  black   Melon   33     172    9.5
6   Cornelia    TX    red   Beans   69     150    2.2

In [106]:
df2.index

RangeIndex(start=0, stop=7, step=1)

This object is similar to Python **`range`** objects. Let's create one:

In [107]:
range(7)

range(0, 7)

Converting both of these objects to a list produces the exact same thing:

In [108]:
list(df2.index)

[0, 1, 2, 3, 4, 5, 6]

In [109]:
list(range(7))

[0, 1, 2, 3, 4, 5, 6]

For now, it's not at all important that you have a **`RangeIndex`**. Selections from it happen just the same with **`.loc`** and **`.iloc`**. Let's look at some examples.

In [110]:
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

In [0]:
col = [1,4]

In [122]:
df.iloc[[1,3,5], col]

           color  height
Niko       green      70
Penelope   white      80
Christina  black     172

In [123]:
df2.loc[[2, 4, 5], ['food', 'color']]

     food  color
2   Mango    red
4  Cheese   gray
5   Melon  black

In [124]:
df2.iloc[[2, 4, 5], [3,2]]

     food  color
2   Mango    red
4  Cheese   gray
5   Melon  black

There is a subtle difference when using a slice. **`.iloc`** excludes the last value, while **`.loc`** includes it:

In [125]:
df2.iloc[:3]

   Names state  color   food  age  height  score
0   Jane    NY   blue  Steak   30     165    4.6
1   Niko    TX  green   Lamb    2      70    8.3
2  Aaron    FL    red  Mango   12     120    9.0

In [126]:
df2.loc[:3]

      Names state  color   food  age  height  score
0      Jane    NY   blue  Steak   30     165    4.6
1      Niko    TX  green   Lamb    2      70    8.3
2     Aaron    FL    red  Mango   12     120    9.0
3  Penelope    AL  white  Apple    4      80    3.3

# Selecting the same column twice?
This is rather peculiar, but you can actually select the same column more than once:

In [129]:
df[['age', 'age', 'age']]

           age  age  age
Jane        30   30   30
Niko         2    2    2
Aaron       12   12   12
Penelope     4    4    4
Dean        32   32   32
Christina   33   33   33
Cornelia    69   69   69

# Summary of Part 1
We covered an incredible amount of Knowledge. Let's summarize all the main points:

* Before learning pandas, ensure you have the fundamentals of Python
* Always refer to the documentation when learning new pandas operations
* The DataFrame and the Series are the containers of data
* A DataFrame is two-dimensional, tabular data
* A Series is a single dimension of data
* The three components of a DataFrame are the **index**, the **columns** and the **data** (or **values**)
* Each row and column of the DataFrame is referenced by both a **label** and an **integer location**
* There are three primary ways to select subsets from a DataFrame - **`[]`**, **`.loc`** and **`.iloc`**
* I use the term **just the indexing operator** to refer to **`[]`** immediately following a DataFrame/Series
* Just the indexing operator's primary purpose is to select a column or columns from a DataFrame
* Using a single column name to just the indexing operator returns a single column of data as a Series
* Passing multiple columns in a list to just the indexing operator returns a DataFrame
* A Series has two components, the **index** and the **data** (**values**). It has no columns
* **`.loc`** makes selections **only by label**
* **`.loc`** can simultaneously select rows and columns
* **`.loc`** can make selections with either a single label, a list of labels, or a slice of labels
* **`.loc`** makes row selections first followed by column selections: **`df.loc[row_selection, col_selection]`**
* **`.iloc`** is analogous to **.`loc`** but uses only **integer location** to refer to rows or columns.
* **`.loc`** and **`.iloc`** work the same for Series except they only select based on the index as their are no columns
* Pandas combines the power of python lists (selection via integer location) and dictionaries (selection by label)
* You can use just the indexing operator to select rows from a DataFrame, but I recommend against this and instead sticking with the explicit **`.loc`** and **`.iloc`**

In [0]:
import pandas as pd
df = pd.read_csv('data/food_inspections.csv')
df.head()

# Tip!
Append the **`head`** method at the end of your statements to prevent long output as was done above.

# Solutions
Make sure you check your answers with the solutions notebook.

### Exercise 1
<span  style="color:green; font-size:16px">The current DataFrame has a simple `RangeIndex`. Let make the **`DBA Name`** column as  <b>index</b> permanently to make it more meaningful. Save the result to variable **`df`** and output the first five rows with the **`head`** method.</span>

In [0]:
## your code here

### Exercise 2
<span  style="color:green; font-size:16px">Select the **`Risk`** column as a Series with [ ].</span>

In [0]:
## your code here

### Exercise 3
<span  style="color:green; font-size:16px">Select the **`Risk`** and **`Results`** columns</span>

In [0]:
## your code here

### Exercise 4
<span  style="color:green; font-size:16px">Select any   column as a DataFrame</span>

In [0]:
##your code here

### Exercise 5
<span  style="color:green; font-size:16px">Select the row for the restaurant **`WILD GOOSE BAR & GRILL`**.  What object is returned?</span>

In [0]:
##your code here

### Exercise 6
<span  style="color:green; font-size:16px">Select the rows for the restaurants **`WILD GOOSE BAR & GRILL`** and **`TAQUERIA HACIENDA TAPATIA`** along with columns **`Risk`** and **`Results`**.</span>

In [0]:
##your code here

### Exercise 7
<span  style="color:green; font-size:16px">What is the risk of restaurant **`SCRUB A DUB`**?</span>

In [0]:
##your code here

### Exercise 8
<span  style="color:green; font-size:16px">Select every 3,000th restaurant from **`THRESHOLD SCHOOL`** to **`SCRUB A DUB`** and the columns from **`Inspection Type`** on to the end of the DataFrame.</span>

In [0]:
##your code here

### Exercise 9
<span  style="color:green; font-size:16px">Select all columns from the 500th restaurant to the 510th</span>

In [0]:
##your code here

### Exercise 10
<span  style="color:green; font-size:16px">Select restaurants 100, 1,000 and 10,000 along with columns 5, 3, and 1</span>

In [0]:
##your code here

### Exercise 11
<span  style="color:green; font-size:16px">Select the **`Risk`** column and save it as a Series</span>

In [0]:
##your code here

### Exercise 12
<span  style="color:green; font-size:16px">Using the risk Series, select **`ARBYS`** and **`POPEYES FAMOUS FRIED CHICKEN`**</span>

In [0]:
##your code here